Terraform Plan:

https://github.com/connormaglynn/infrastructure/pull/33/checks#step:5:1

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/connormaglynn/github/runs/run-BPJTKWjm9cjK1wR2

Waiting for the plan to start...

Terraform v1.6.6
on linux_amd64
Initializing plugins and modules...
github_repository.infrastructure: Refreshing state... [id=infrastructure]
github_repository.example_of_terraform_managed: Refreshing state... [id=example-of-terraform-managed-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.infrastructure will be updated in-place
  ~ resource "github_repository" "infrastructure" {
      ~ allow_squash_merge          = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "infrastructure"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "infrastructure"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
        # (28 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories.github_repository.repositories["scripts"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge            = false
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "scripts"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 3 estimated
           $0.0/mo +$0.0

```